# GBXMLExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLExportOptions Class
Members See Also
---
Green-Building XML Export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class GBXMLExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class GBXMLExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class GBXMLExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GBXMLExportOptions
# See Also
GBXMLExportOptions Members
Autodesk.Revit.DB Namespace